GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Include/BLE/ble_defs.h
/* ACI GATT/ATT events */
#define ACI_GATT_ATTRIBUTE_MODIFIED_EVENT			0x0C01
#define ACI_GATT_PROC_TIMEOUT_EVENT				0x0C02
#define ACI_ATT_EXCHANGE_MTU_RESP_EVENT				0x0C03
#define ACI_ATT_FIND_INFO_RESP_EVENT				0x0C04
#define ACI_ATT_FIND_BY_TYPE_VALUE_RESP_EVENT			0x0C05
#define ACI_ATT_READ_BY_TYPE_RESP_EVENT				0x0C06
#define ACI_ATT_READ_RESP_EVENT					0x0C07
#define ACI_ATT_READ_BLOB_RESP_EVENT				0x0C08
#define ACI_ATT_READ_MULTIPLE_RESP_EVENT			0x0C09
#define ACI_ATT_READ_BY_GROUP_TYPE_RESP_EVENT			0x0C0A
#define ACI_ATT_PREPARE_WRITE_RESP_EVENT			0x0C0C
#define ACI_ATT_EXEC_WRITE_RESP_EVENT				0x0C0D
#define ACI_GATT_INDICATION_EVENT				0x0C0E
#define ACI_GATT_NOTIFICATION_EVENT				0x0C0F
#define ACI_GATT_PROC_COMPLETE_EVENT				0x0C10
#define ACI_GATT_ERROR_RESP_EVENT				0x0C11
#define ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_EVENT		0x0C12
#define ACI_GATT_WRITE_PERMIT_REQ_EVENT				0x0C13
#define ACI_GATT_READ_PERMIT_REQ_EVENT				0x0C14
#define ACI_GATT_READ_MULTI_PERMIT_REQ_EVENT			0x0C15
#define ACI_GATT_TX_POOL_AVAILABLE_EVENT			0x0C16
#define ACI_GATT_SERVER_CONFIRMATION_EVENT			0x0C17
#define ACI_GATT_PREPARE_WRITE_PERMIT_REQ_EVENT			0x0C18
#define ACI_GATT_EATT_BEARER_EVENT				0x0C19
#define ACI_GATT_MULT_NOTIFICATION_EVENT			0x0C1A
#define ACI_GATT_READ_EXT_EVENT					0x0C1D
#define ACI_GATT_INDICATION_EXT_EVENT				0x0C1E
#define ACI_GATT_NOTIFICATION_EXT_EVENT				0x0C1F

/* ------------------------------------------------------------------------- */

/* ACI GAP vendor specific event codes
 */

/* ACI_GAP_LIMITED_DISCOVERABLE_EVENT code: */
#define ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE         0x0400U

/* ACI_GAP_PAIRING_COMPLETE_EVENT code: */
#define ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE             0x0401U

/* ACI_GAP_PASS_KEY_REQ_EVENT code: */
#define ACI_GAP_PASS_KEY_REQ_VSEVT_CODE                 0x0402U

/* ACI_GAP_AUTHORIZATION_REQ_EVENT code: */
#define ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE            0x0403U

/* ACI_GAP_SLAVE_SECURITY_INITIATED_EVENT code: */
#define ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE     0x0404U

/* ACI_GAP_BOND_LOST_EVENT code: */
#define ACI_GAP_BOND_LOST_VSEVT_CODE                    0x0405U

/* ACI_GAP_PROC_COMPLETE_EVENT code: */
#define ACI_GAP_PROC_COMPLETE_VSEVT_CODE                0x0407U

/* ACI_GAP_ADDR_NOT_RESOLVED_EVENT code: */
#define ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE            0x0408U

/* ACI_GAP_NUMERIC_COMPARISON_VALUE_EVENT code: */
#define ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE     0x0409U

/* ACI_GAP_KEYPRESS_NOTIFICATION_EVENT code: */
#define ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE        0x040AU

/* ACI GATT/ATT vendor specific event codes
 */

/* ACI_GATT_ATTRIBUTE_MODIFIED_EVENT code: */
#define ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE          0x0C01U

/* ACI_GATT_PROC_TIMEOUT_EVENT code: */
#define ACI_GATT_PROC_TIMEOUT_VSEVT_CODE                0x0C02U

/* ACI_ATT_EXCHANGE_MTU_RESP_EVENT code: */
#define ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE            0x0C03U

/* ACI_ATT_FIND_INFO_RESP_EVENT code: */
#define ACI_ATT_FIND_INFO_RESP_VSEVT_CODE               0x0C04U

/* ACI_ATT_FIND_BY_TYPE_VALUE_RESP_EVENT code: */
#define ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE      0x0C05U

/* ACI_ATT_READ_BY_TYPE_RESP_EVENT code: */
#define ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE            0x0C06U

/* ACI_ATT_READ_RESP_EVENT code: */
#define ACI_ATT_READ_RESP_VSEVT_CODE                    0x0C07U

/* ACI_ATT_READ_BLOB_RESP_EVENT code: */
#define ACI_ATT_READ_BLOB_RESP_VSEVT_CODE               0x0C08U

/* ACI_ATT_READ_MULTIPLE_RESP_EVENT code: */
#define ACI_ATT_READ_MULTIPLE_RESP_VSEVT_CODE           0x0C09U

/* ACI_ATT_READ_BY_GROUP_TYPE_RESP_EVENT code: */
#define ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE      0x0C0AU

/* ACI_ATT_PREPARE_WRITE_RESP_EVENT code: */
#define ACI_ATT_PREPARE_WRITE_RESP_VSEVT_CODE           0x0C0CU

/* ACI_ATT_EXEC_WRITE_RESP_EVENT code: */
#define ACI_ATT_EXEC_WRITE_RESP_VSEVT_CODE              0x0C0DU

/* ACI_GATT_INDICATION_EVENT code: */
#define ACI_GATT_INDICATION_VSEVT_CODE                  0x0C0EU

/* ACI_GATT_NOTIFICATION_EVENT code: */
#define ACI_GATT_NOTIFICATION_VSEVT_CODE                0x0C0FU

/* ACI_GATT_PROC_COMPLETE_EVENT code: */
#define ACI_GATT_PROC_COMPLETE_VSEVT_CODE               0x0C10U

/* ACI_GATT_ERROR_RESP_EVENT code: */
#define ACI_GATT_ERROR_RESP_VSEVT_CODE                  0x0C11U

/* ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_EVENT code: */
#define ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE 0x0C12U

/* ACI_GATT_WRITE_PERMIT_REQ_EVENT code: */
#define ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE            0x0C13U

/* ACI_GATT_READ_PERMIT_REQ_EVENT code: */
#define ACI_GATT_READ_PERMIT_REQ_VSEVT_CODE             0x0C14U

/* ACI_GATT_READ_MULTI_PERMIT_REQ_EVENT code: */
#define ACI_GATT_READ_MULTI_PERMIT_REQ_VSEVT_CODE       0x0C15U

/* ACI_GATT_TX_POOL_AVAILABLE_EVENT code: */
#define ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE           0x0C16U

/* ACI_GATT_SERVER_CONFIRMATION_EVENT code: */
#define ACI_GATT_SERVER_CONFIRMATION_VSEVT_CODE         0x0C17U

/* ACI_GATT_PREPARE_WRITE_PERMIT_REQ_EVENT code: */
#define ACI_GATT_PREPARE_WRITE_PERMIT_REQ_VSEVT_CODE    0x0C18U

/* ACI_GATT_READ_EXT_EVENT code: */
#define ACI_GATT_READ_EXT_VSEVT_CODE                    0x0C1DU

/* ACI_GATT_INDICATION_EXT_EVENT code: */
#define ACI_GATT_INDICATION_EXT_VSEVT_CODE              0x0C1EU

/* ACI_GATT_NOTIFICATION_EXT_EVENT code: */
#define ACI_GATT_NOTIFICATION_EXT_VSEVT_CODE            0x0C1FU

/* ACI L2CAP vendor specific event codes
 */

/* ACI_L2CAP_CONNECTION_UPDATE_RESP_EVENT code: */
#define ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE     0x0800U

/* ACI_L2CAP_PROC_TIMEOUT_EVENT code: */
#define ACI_L2CAP_PROC_TIMEOUT_VSEVT_CODE               0x0801U

/* ACI_L2CAP_CONNECTION_UPDATE_REQ_EVENT code: */
#define ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE      0x0802U

/* ACI_L2CAP_COMMAND_REJECT_EVENT code: */
#define ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE             0x080AU

/* ACI_L2CAP_COC_CONNECT_EVENT code: */
#define ACI_L2CAP_COC_CONNECT_VSEVT_CODE                0x0810U

