GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Include/BLE/ble_defs.h
/* Format
 */
#define FORMAT_UINT8                             0x04U
#define FORMAT_UINT16                            0x06U
#define FORMAT_SINT16                            0x0EU
#define FORMAT_SINT24                            0x0FU

/* Unit
 */
#define UNIT_UNITLESS                          0x2700
#define UNIT_TEMP_CELSIUS                      0x272F
#define UNIT_PRESSURE_BAR                      0x2780

/* ------------------------------------------------------------------------- */

/* Advertising policy for filtering (white list related)
 * See HCI_LE_SET_ADVERTISING_PARAMETERS
 */
#define NO_WHITE_LIST_USE                      0X00U
#define WHITE_LIST_FOR_ONLY_SCAN               0X01U
#define WHITE_LIST_FOR_ONLY_CONN               0X02U
#define WHITE_LIST_FOR_ALL                     0X03U

/* Advertising channels
 */
#define ADV_CH_37                              0x01
#define ADV_CH_38                              0x02
#define ADV_CH_39                              0x04

/* ------------------------------------------------------------------------- */

/* Offset for configuration values (see ACI_HAL_WRITE_CONFIG_DATA)
 */
#define CONFIG_DATA_PUBADDR_OFFSET             0x00U
#define CONFIG_DATA_ER_OFFSET                  0x08U
#define CONFIG_DATA_IR_OFFSET                  0x18U
#define CONFIG_DATA_RANDOM_ADDRESS_OFFSET      0x2EU
#define CONFIG_DATA_SMP_MODE_OFFSET            0xB0U
#define CONFIG_DATA_LL_SCAN_CHAN_MAP_OFFSET    0xC0U

/* Length for configuration values (see ACI_HAL_WRITE_CONFIG_DATA)
 */
#define CONFIG_DATA_PUBADDR_LEN                6
#define CONFIG_DATA_ER_LEN                    16
#define CONFIG_DATA_IR_LEN                    16
#define CONFIG_DATA_RANDOM_ADDRESS_LEN         6
#define CONFIG_DATA_SMP_MODE_LEN               1
#define CONFIG_DATA_LL_SCAN_CHAN_MAP_LEN       1

/* ------------------------------------------------------------------------- */


#endif /* BLE_DEFS_H__ */
